# SpotElevIndTop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotElevIndTop Property
ParameterTypeId Class See Also
---
"Top Indicator"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotElevIndTop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevIndTop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotElevIndTop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace